# TextRange Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange Constructor
TextRange Class See Also
---
Constructs a TextRange with default values for start and length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public TextRange()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TextRange()
```

# Remarks
The start and length are set to be 0 by default.
# See Also
TextRange Class
TextRange Overload
Autodesk.Revit.DB Namespace